Revit 2026 API

# FabricationDimensionDefinitionIsModifiable Property

---

If the fabrication dimension is modifiable by user.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsModifiable { get; }
```
```vb
Public ReadOnly Property IsModifiable As Boolean
	Get
```
```cpp
public:
property bool IsModifiable {
	bool get ();
}
```
```fsharp
member IsModifiable : bool with get
```

#### Property Value

Boolean

#### Reference

FabricationDimensionDefinition Class

Autodesk.Revit.DB Namespace